balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F47J13.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PORTC" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC0" edc:desc="" edc:mask="0x1" edc:name="RC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1" edc:desc="" edc:mask="0x1" edc:name="RC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2" edc:desc="" edc:mask="0x1" edc:name="RC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3" edc:desc="" edc:mask="0x1" edc:name="RC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC4" edc:desc="" edc:mask="0x1" edc:name="RC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5" edc:desc="" edc:mask="0x1" edc:name="RC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC6" edc:desc="" edc:mask="0x1" edc:name="RC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7" edc:desc="" edc:mask="0x1" edc:name="RC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RC" edc:desc="" edc:mask="0xff" edc:name="RC" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T1OSO" edc:desc="" edc:mask="0x1" edc:name="T1OSO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1OSI" edc:desc="" edc:mask="0x1" edc:name="T1OSI" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AN11" edc:desc="" edc:mask="0x1" edc:name="AN11" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PMA5" edc:desc="" edc:mask="0x1" edc:name="PMA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMA4" edc:desc="" edc:mask="0x1" edc:name="PMA4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T1CKI" edc:desc="" edc:mask="0x1" edc:name="T1CKI" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CTPLS" edc:desc="" edc:mask="0x1" edc:name="CTPLS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TX1" edc:desc="" edc:mask="0x1" edc:name="TX1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RX1" edc:desc="" edc:mask="0x1" edc:name="RX1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="RP11" edc:desc="" edc:mask="0x1" edc:name="RP11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12" edc:desc="" edc:mask="0x1" edc:name="RP12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13" edc:desc="" edc:mask="0x1" edc:name="RP13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCL1" edc:desc="" edc:mask="0x1" edc:name="SCL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDA1" edc:desc="" edc:mask="0x1" edc:name="SDA1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CK1" edc:desc="" edc:mask="0x1" edc:name="CK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DT1" edc:desc="" edc:mask="0x1" edc:name="DT1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="C2IND" edc:desc="" edc:mask="0x1" edc:name="C2IND" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP14" edc:desc="" edc:mask="0x1" edc:name="RP14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP15" edc:desc="" edc:mask="0x1" edc:name="RP15" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP16" edc:desc="" edc:mask="0x1" edc:name="RP16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP17" edc:desc="" edc:mask="0x1" edc:name="RP17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP18" edc:desc="" edc:mask="0x1" edc:name="RP18" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.5">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CCP8" edc:desc="" edc:mask="0x1" edc:name="CCP8" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SCK1" edc:desc="" edc:mask="0x1" edc:name="SCK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1" edc:desc="" edc:mask="0x1" edc:name="SDI1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDO1" edc:desc="" edc:mask="0x1" edc:name="SDO1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP9" edc:desc="" edc:mask="0x1" edc:name="CCP9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP10" edc:desc="" edc:mask="0x1" edc:name="CCP10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PORTD" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD0" edc:desc="" edc:mask="0x1" edc:name="RD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD1" edc:desc="" edc:mask="0x1" edc:name="RD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD2" edc:desc="" edc:mask="0x1" edc:name="RD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD3" edc:desc="" edc:mask="0x1" edc:name="RD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4" edc:desc="" edc:mask="0x1" edc:name="RD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5" edc:desc="" edc:mask="0x1" edc:name="RD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6" edc:desc="" edc:mask="0x1" edc:name="RD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7" edc:desc="" edc:mask="0x1" edc:name="RD7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RD" edc:desc="" edc:mask="0xff" edc:name="RD" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PMD0" edc:desc="" edc:mask="0x1" edc:name="PMD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMD1" edc:desc="" edc:mask="0x1" edc:name="PMD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMD2" edc:desc="" edc:mask="0x1" edc:name="PMD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMD3" edc:desc="" edc:mask="0x1" edc:name="PMD3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMD4" edc:desc="" edc:mask="0x1" edc:name="PMD4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMD5" edc:desc="" edc:mask="0x1" edc:name="PMD5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMD6" edc:desc="" edc:mask="0x1" edc:name="PMD6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMD7" edc:desc="" edc:mask="0x1" edc:name="PMD7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SCL2" edc:desc="" edc:mask="0x1" edc:name="SCL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDA2" edc:desc="" edc:mask="0x1" edc:name="SDA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP19" edc:desc="" edc:mask="0x1" edc:name="RP19" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP20" edc:desc="" edc:mask="0x1" edc:name="RP20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP21" edc:desc="" edc:mask="0x1" edc:name="RP21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP22" edc:desc="" edc:mask="0x1" edc:name="RP22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP23" edc:desc="" edc:mask="0x1" edc:name="RP23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP24" edc:desc="" edc:mask="0x1" edc:name="RP24" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="PORTE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----uuu" edc:name="PORTE" edc:nzwidth="0x8" edc:por="-----xxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE0" edc:desc="" edc:mask="0x1" edc:name="RE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1" edc:desc="" edc:mask="0x1" edc:name="RE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2" edc:desc="" edc:mask="0x1" edc:name="RE2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RE" edc:desc="" edc:mask="0xff" edc:name="RE" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AN5" edc:desc="" edc:mask="0x1" edc:name="AN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AN6" edc:desc="" edc:mask="0x1" edc:name="AN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AN7" edc:desc="" edc:mask="0x1" edc:name="AN7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PMPRD" edc:desc="" edc:mask="0x1" edc:name="PMPRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMPWR" edc:desc="" edc:mask="0x1" edc:name="PMPWR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMPCS" edc:desc="" edc:mask="0x1" edc:name="PMPCS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="PMRD" edc:desc="" edc:mask="0x1" edc:name="PMRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMWR" edc:desc="" edc:mask="0x1" edc:name="PMWR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMCS" edc:desc="" edc:mask="0x1" edc:name="PMCS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="HLVDCON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="HLVDCON" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="HLVDL" edc:desc="" edc:mask="0xf" edc:name="HLVDL" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="HLVDEN" edc:desc="" edc:mask="0x1" edc:name="HLVDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRVST" edc:desc="" edc:mask="0x1" edc:name="IRVST" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BGVST" edc:desc="" edc:mask="0x1" edc:name="BGVST" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VDIRMAG" edc:desc="" edc:mask="0x1" edc:name="VDIRMAG" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="HLVDL0" edc:desc="" edc:mask="0x1" edc:name="HLVDL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HLVDL1" edc:desc="" edc:mask="0x1" edc:name="HLVDL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HLVDL2" edc:desc="" edc:mask="0x1" edc:name="HLVDL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HLVDL3" edc:desc="" edc:mask="0x1" edc:name="HLVDL3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMACON2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMACON2" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTLVL" edc:desc="" edc:mask="0xf" edc:name="INTLVL" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DLYCYC" edc:desc="" edc:mask="0xf" edc:name="DLYCYC" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INTLVL0" edc:desc="" edc:mask="0x1" edc:name="INTLVL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTLVL1" edc:desc="" edc:mask="0x1" edc:name="INTLVL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTLVL2" edc:desc="" edc:mask="0x1" edc:name="INTLVL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTLVL3" edc:desc="" edc:mask="0x1" edc:name="INTLVL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLYCYC0" edc:desc="" edc:mask="0x1" edc:name="DLYCYC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLYCYC1" edc:desc="" edc:mask="0x1" edc:name="DLYCYC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLYCYC2" edc:desc="" edc:mask="0x1" edc:name="DLYCYC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLYCYC3" edc:desc="" edc:mask="0x1" edc:name="DLYCYC3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-r-nnn--" edc:cname="OSCCON2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0-1u1--" edc:name="OSCCON2" edc:nzwidth="8" edc:por="-0-101--">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PRISD" edc:desc="" edc:mask="0x1" edc:name="PRISD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SOSCGO" edc:desc="" edc:mask="0x1" edc:name="SOSCGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SOSCDRV" edc:desc="" edc:mask="0x1" edc:name="SOSCDRV" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SOSCRUN" edc:desc="" edc:mask="0x1" edc:name="SOSCRUN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
